Revit 2027 API
BoundaryConditions.IsConstrainedOnHost Property
 The boundary conditions is constrained to host or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsConstrainedOnHost { get; }
Public ReadOnly Property IsConstrainedOnHost As Boolean
	Get
public:
property bool IsConstrainedOnHost {
	bool get ();
}
member IsConstrainedOnHost : bool with get
Property Value
Boolean
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace